<a href="https://colab.research.google.com/github/raynardj/python4ml/blob/master/experiments/books/Books_Dataset_Intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Dataset README
## Introduction to books.db

In [0]:
from sqlalchemy import create_engine
import pandas as pd

### Load the books.db form google drive

In [0]:
from google.colab import drive

drive.mount("mydrive")

In [8]:
!ls mydrive/My\ Drive/data/books/

Books_Dataset_Intro.ipynb  books.db

md5 hash should equal to 32008310dd9f978e597e8a1d6ddf7430

In [9]:
!md5sum mydrive/My\ Drive/data/books/books.db

32008310dd9f978e597e8a1d6ddf7430  mydrive/My Drive/data/books/books.db

### Data Preview

In [0]:
uri = "sqlite:////content/mydrive/My Drive/data/books/books.db"
con = create_engine(uri)

#### Books Table

In [14]:
books = pd.read_sql("SELECT * FROM books LIMIT 20",con=con)
books

    book_id  ...               cate1
0         0  ...  English Literature
1         1  ...    Translated Works
2         2  ...  English Literature
3         3  ...  English Literature
4         4  ...  English Literature
5         5  ...  English Literature
6         6  ...  English Literature
7         7  ...  English Literature
8         8  ...  English Literature
9         9  ...    Translated Works
10       10  ...  English Literature
11       11  ...    Translated Works
12       12  ...    Translated Works
13       13  ...    Translated Works
14       14  ...  English Literature
15       15  ...  English Literature
16       16  ...  English Literature
17       17  ...    Translated Works
18       18  ...  English Literature
19       19  ...  English Literature

[20 rows x 4 columns]

The book_id is the id of this table, the author_id maps the to author table 

#### Author Table

In [0]:
authors = pd.read_sql("authors", con = con)

##### About author data
* Negative integers in born death column is the "BC" year
* Born, death year = 10000 means we don't possess the record on the birth/death of such author

In [16]:
authors.head()

   index         author   born  death
0      0  Adam Ferguson   1723   1816
1      1   Adam Smith     1723   1790
2      2      Aeschylus    525  10000
3      3          Aesop  10000  10000
4      4    Alan Seeger   1888   1916

### About chapter
* Each book could have >=1 chapters
* Each chapter is mapped to a txt or htm format text in the table "text_files"
* The mapping relationship between books and their chapters are stored in the table "book_filles"

#### Table: text_files

* text: the text content of the book, not pretty if you look upon the following table, but will be much prettier if you show them in html like  ```<pre> your book text here </pre>```

In [18]:
pd.read_sql("SELECT * FROM text_files LIMIT 3",con = con)

   index  fmt                                               text
0      0  txt  \n\n\n\n\n\n\n\nThe Song of Roland\n\n\n\n\n\n...
1      1  txt  \n\n\n\n\n\n\n\n\n\n\t\tAesop's Fables \n\n\n\...
2      2  txt  \n\n\n\n\n\n\n\n\n\n              KHALIFAH THE...

#### Table:  book_file

* file_id: The "index" in the "text_file" table
* book_id: The "book_id" in the "books" table
* chapter: chapter name, if chapter name==Nan, it means the book only has 1 chapter

In [20]:
pd.read_sql("SELECT * FROM book_file LIMIT 10",con = con)

   index  file_id  book_id                          chapter
0      0        0      943                              Nan
1      1        1       54                              Nan
2      2        2      681                      25-khalifah
3      3        3      681                   Entertainments
4      4        4      681  02-the Fishmerman And The Jinni
5      5        5      681                    31-conclusion
6      6        6      681    06-the Second Kalandar's Tale
7      7        7      681                       26-abu Kir
8      8        8      681            16-sindbad The Seaman
9      9        9      681     07-the Third Kalandar's Tale